<a href="https://colab.research.google.com/github/khalidpark/data_engineer_whitepaper/blob/main/data_engineer_whitepaper.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 데이터셋 불러오기

## pd.read_csv

In [1]:
ktng_data_url = 'https://ds-lecture-data.s3.ap-northeast-2.amazonaws.com/kt%26g/kt%26g_0.csv'

In [2]:
import pandas as pd

df = pd.read_csv(ktng_data_url) # pd라이브러리의 read_csv를 사용하여 ktng_data_url에 있는 데이터를 읽고, df라는 변수에 저장

df.head()

    19/6  12,578  3,991 3,991.1  4,452  ...  9.37  31.43  803.22  2,351  13.77
0   19/9  13,222  3,825   3,825  4,503  ...  9.95  24.17  836.86  2,337  13.87
1  19/12  11,982  2,523   2,523  1,794  ...  9.96  23.04  850.82    873  12.42
2   20/3  11,784  3,150   3,150  4,156  ...  9.79  29.69  823.16  2,134   9.71
3   20/6  13,188  3,947   3,947  4,020  ...  9.40  26.91  837.40  2,135  10.46

[4 rows x 25 columns]

## df.shape

## dataframe column 지정

In [4]:
column_headers = ['분기','매출액','영업이익','영업이익(발표기준)','세전계속사업이익',
                  '당기순이익','당기순이익(지배)','당기순이익(비지배)','자산총계','부채총계',
                  '자본총계','자본총계(지배)','자본총계(비지배)','자본금','영업활동현금흐름',
                  '투자활동현금흐름','재무활동현금흐름','영업이익률','순이익률','ROE(%)',
                  'ROA(%)','부채비율','자본유보율','EPS(원)','PER(배)']

df = pd.read_csv(ktng_data_url, names = column_headers)

print(df.head())
print(df.shape)

      분기     매출액   영업이익 영업이익(발표기준)  ...   부채비율   자본유보율 EPS(원)  PER(배)
0   19/6  12,578  3,991      3,991  ...  31.43  803.22  2,351   13.77
1   19/9  13,222  3,825      3,825  ...  24.17  836.86  2,337   13.87
2  19/12  11,982  2,523      2,523  ...  23.04  850.82    873   12.42
3   20/3  11,784  3,150      3,150  ...  29.69  823.16  2,134    9.71
4   20/6  13,188  3,947      3,947  ...  26.91  837.40  2,135   10.46

[5 rows x 25 columns]
(5, 25)

# EDA

EDA란, 데이터 분석에 있어서 매우 중요한, 초기 분석의 단계를 의미

시각화 같은 도구를 통해서 패턴을 발견하거나

데이터의 특이성을 확인하거나

통계와 그래픽 (혹은 시각적 표현)을 통해서 가설을 검정하는 과정 등을 포함

EDA의 방법은 크게 2가지 (Graphic, Non-Graphic) 으로 나눠질 수 있으며

 EDA의 "타겟"(데이터) 또한 2가지 (Univariate, Multi-variate)로 나눠집니다.

## Uni - Non Graphic

Numeric data의 경우 summary statistics

Categorical data의 경우 occurence, frequency, tabulation

## Uni - Graphic

Histogram 혹은 Pie chart, Stem-leaf plot, Boxplot, QQplot

## Multi uni - Non Graphic

Relationship을 보는 것이 주된 목표

Cross-Tabulation , Cross-Statistics (Correlation, Covariance)

## Multi uni - Graphic

Category & Numeric : Boxplots, Stacked bar, Parallel Coordinate, Heatmap

# EDA 이후

## 데이터 전처리 (Data preprocessing)

## cleaning, intergration, transformation, reduction

Data Cleaning : noise 를 제거하거나, inconsistency 를 보정하는 과정

Data intergration : 여러개로 나누어져 있는 데이터들을 분석하기 편하게 하나로 합치는 과정

Data transformation : 데이터의 형태를 변환하는 작업

Data reduction : 데이터를 의미있게 줄이는 것



---

# Feature Engineering

도메인 지식과 창의성을 바탕으로, 데이터셋에 존재하는 Feature들을 재조합하여 새로운 Feature를 만드는 것

# String & Type case

In [5]:
# 입력된 문자열에 대해서 같은 작업을 하는 함수 작성
def toInt(string):
    return int(string.replace(',',''))

In [6]:
# 예시 데이터를 바탕으로 함수를 테스트
toInt('25,970')

25970

## df.apply

In [ ]:
df['자산2'] = df['자산'].apply(toInt)
df



---

# Data Manipulation

## concat

In [8]:
import pandas as pd
x = pd.DataFrame([['AX','AY'],['BX','BY']], index = ['A','B'], columns = ['X','Y'])
y = pd.DataFrame([['AX','AZ'],['CX','CZ']], index = ['A','C'], columns = ['X','Z'])

In [9]:
x

    X   Y
A  AX  AY
B  BX  BY

In [10]:
y

    X   Z
A  AX  AZ
C  CX  CZ

In [11]:
pd.concat([x, y]) ## concate_by_row

    X    Y    Z
A  AX   AY  NaN
B  BX   BY  NaN
A  AX  NaN   AZ
C  CX  NaN   CZ

In [12]:
pd.concat([x, y], axis = 1) ## concate_by_column

     X    Y    X    Z
A   AX   AY   AX   AZ
B   BX   BY  NaN  NaN
C  NaN  NaN   CX   CZ

## merge

inner-join

공통된 부분을 기반으로 합치기가 주요 용도

In [16]:
df1 = pd.DataFrame(
    {'종목' : ['000080', '000890', '005300', '027740', '035810', '136480', '136490'],
     '코드': ['111111', '2222222', '3333333', '4444444', '5555555', '6666666', '777777'], 
     '매출' : ['10억', '20억', '1억', '5억', '200억', '2000억', '7777억']}
)
df1

       종목       코드     매출
0  000080   111111    10억
1  000890  2222222    20억
2  005300  3333333     1억
3  027740  4444444     5억
4  035810  5555555   200억
5  136480  6666666  2000억
6  136490   777777  7777억

In [17]:
df2 = pd.DataFrame(
    {'종목' : ['000080', '000890', '005300', '027740', '035810', '136480', '136490'],
     '종목명': ['하이트진로', '보해양조', '롯데칠성', '마니커', '이지홀딩스', '하림', '선진'], 
     '테마' : ['주류', '주류', '주류', '육계', '육계', '육계', '돼지고기']}
)
df2

       종목    종목명    테마
0  000080  하이트진로    주류
1  000890   보해양조    주류
2  005300   롯데칠성    주류
3  027740    마니커    육계
4  035810  이지홀딩스    육계
5  136480     하림    육계
6  136490     선진  돼지고기

In [19]:
pd.concat([df1, df2], axis = 1)

       종목       코드     매출      종목    종목명    테마
0  000080   111111    10억  000080  하이트진로    주류
1  000890  2222222    20억  000890   보해양조    주류
2  005300  3333333     1억  005300   롯데칠성    주류
3  027740  4444444     5억  027740    마니커    육계
4  035810  5555555   200억  035810  이지홀딩스    육계
5  136480  6666666  2000억  136480     하림    육계
6  136490   777777  7777억  136490     선진  돼지고기

In [20]:
df = df1.merge(df2, how = 'inner', on = '종목')
df

       종목       코드     매출    종목명    테마
0  000080   111111    10억  하이트진로    주류
1  000890  2222222    20억   보해양조    주류
2  005300  3333333     1억   롯데칠성    주류
3  027740  4444444     5억    마니커    육계
4  035810  5555555   200억  이지홀딩스    육계
5  136480  6666666  2000억     하림    육계
6  136490   777777  7777억     선진  돼지고기

## isin

In [21]:
df_isin = df[df['테마'].isin(['주류'])]

In [22]:
df_isin

       종목       코드   매출    종목명  테마
0  000080   111111  10억  하이트진로  주류
1  000890  2222222  20억   보해양조  주류
2  005300  3333333   1억   롯데칠성  주류

## groupby

In [25]:
df['코드'] = pd.to_numeric(df['코드'])

df.groupby('테마').코드.mean()

테마
돼지고기    7.777770e+05
육계      5.555555e+06
주류      1.888889e+06
Name: 코드, dtype: float64

# Tidy Data

## melt , pivot_table

데이터 형태 변환

데이터시각화에 쓰이는 Seaborn 라이브러리는 "Tidy"한 데이터를 필요로 합니다

In [26]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['X', 'Y', 'Z'], 
    columns=['A', 'B'])

table1

      A   B
X   NaN   2
Y  16.0  11
Z   3.0   1

## wide -> tidy

In [28]:
### 행의 인덱스를 선택하고, 이를 행으로 새로 추가합니다.
tidy1 = table1.reset_index() # rownames를 새로 설정 
tidy1

  index     A   B
0     X   NaN   2
1     Y  16.0  11
2     Z   3.0   1

In [29]:
### 각 행에 대해서 (unique identifier)를 확인합니다.
### 한개의 "tidy" 한 열에 대해서 포함되어야 할 (기준이 되는) 데이터를 선택합니다.
tidy1 = tidy1.melt(id_vars = 'index', value_vars = ['A', 'B'])
tidy1

  index variable  value
0     X        A    NaN
1     Y        A   16.0
2     Z        A    3.0
3     X        B    2.0
4     Y        B   11.0
5     Z        B    1.0

In [31]:
# 열의 이름을 수정합니다.
tidy1 = tidy1.rename(
    columns = {
        'index': 'row', 
        'variable': 'column', 
        'value': 'value'
        }
)
tidy1

  row column  value
0   X      A    NaN
1   Y      A   16.0
2   Z      A    3.0
3   X      B    2.0
4   Y      B   11.0
5   Z      B    1.0

## tidy -> wide

In [32]:
# 파라미터에 대한 설명
# index: unique identifier
# columns: "wide" 데이터에서 column별로 다르게 하고자 하는 값.
# values: 결과값이 들어가는 곳 (wide 데이터프레임의 내용에 들어갈 값)
wide = tidy1.pivot_table(index = 'row', columns = 'column', values = 'value')
wide

column     A     B
row
X        NaN   2.0
Y       16.0  11.0
Z        3.0   1.0



---